pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_abs.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2014(2015) Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_usb_creg_abs.c
* Description  : Call USB register access function
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*         : 04.01.2014 1.00 First Release
*         : 30.01.2015 1.01    Added RX71M.
***********************************************************************************************************************/


/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
#include "r_usb_basic_if.h"
#include "r_usb_reg_access.h"


/******************************************************************************
Constant macro definitions
******************************************************************************/
/* Condition compilation by the difference of the endian */
#if USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP
    #define USB_FIFOENDIAN      USB_FIFO_LITTLE
#else   /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
    #define USB_FIFOENDIAN      USB_FIFO_BIG
#endif  /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */

#define USB_BUFSIZE_BIT 10

/******************************************************************************
Static variables and functions
******************************************************************************/
#ifdef USB_DTC_ENABLE
static  void        usb_cstd_D0FifoselSet(USB_UTR_t *ptr);
#endif /* USB_DTC_ENABLE */
/******************************************************************************
Private global variables and functions
******************************************************************************/
uint16_t    usb_gcstd_RhstBit;
uint16_t    usb_gcstd_DvsqBit;
uint16_t    usb_gcstd_AddrBit;
uint16_t    usb_gcstd_SqmonBit;

/******************************************************************************
Function Name   : usb_cstd_GetUsbIpAdr
Description     : Get base address of the selected USB channel's peripheral 
                : registers.
Argument        : uint16_t ipnum  : USB_USBIP_0 (0), or USB_USBIP_1 (1).
Return          : USB_REGADR_t    : A pointer to the USB_597IP register 
                                  : structure USB_REGISTER containing all USB
                                  : channel's registers.
******************************************************************************/
USB_REGADR_t    usb_cstd_GetUsbIpAdr( uint16_t ipnum )
{
    USB_REGADR_t    ptr;

    if( ipnum == USB_USBIP_0 )
    {
        ptr = (USB_REGADR_t)&USB0;
    }
    else if( ipnum == USB_USBIP_1 )
    {
        ptr = (USB_REGADR_t)&USBA;
    }
    else
    {
        USB_DEBUG_HOOK( USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE1 );
    }

    return ptr;
} /* eof usb_cstd_GetUsbIpAdr() */


/******************************************************************************
Function Name   : usb_cstd_GetD0fifo32Adr
Description     : Get 16 bits of used channel's D0FIFO register content.
Arguments       : USB_UTR_t *ptr : USB system internal structure. Selects channel.
Return          : Address of D0FIFO
******************************************************************************/
uint32_t    usb_cstd_GetD0fifo32Adr( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_0)
    {
        return (uint32_t)0;
    }
    else if(ptr->ip == USB_USBIP_1)
    {
        return (uint32_t)(&ptr->ipp1->D0FIFO.LONG);
    }

    return (uint32_t)0;
}/* eof usb_cstd_GetD0fifo32Adr() */

/******************************************************************************
Function Name   : usb_cstd_GetD0fifo16Adr
Description     : Get 16 bits of used channel's D0FIFO register content.
Arguments       : USB_UTR_t *ptr : USB system internal structure. Selects channel.
Return          : Address of D0FIFO
******************************************************************************/
uint32_t    usb_cstd_GetD0fifo16Adr( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_0)
    {
        return (uint32_t)(&ptr->ipp->D0FIFO.WORD);
    }
    else if(ptr->ip == USB_USBIP_1)
    {
#if USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP
        return (uint32_t)(&ptr->ipp1->D0FIFO.WORD.H);
#else
        return (uint32_t)(&ptr->ipp1->D0FIFO.WORD.L);
#endif  /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
    }

