pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_abs.c
    return 0;
}/* eof usb_cstd_GetD0fifo16Adr() */

/******************************************************************************
Function Name   : usb_cstd_GetD0fifo8Adr
Description     : Get 8 bits of used channel's D0FIFO register content.
Arguments       : USB_UTR_t *ptr : USB system internal structure. Selects channel.
Return          : Address of D0FIFO
******************************************************************************/
uint32_t    usb_cstd_GetD0fifo8Adr( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_0)
    {
        return (uint32_t)(&ptr->ipp->D0FIFO.BYTE.L);
    }
    else if(ptr->ip == USB_USBIP_1)
    {
#if USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP
        return (uint32_t)(&ptr->ipp1->D0FIFO.BYTE.HH);
#else
        return (uint32_t)(&ptr->ipp1->D0FIFO.BYTE.LL);
#endif  /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
    }

    return 0;
}/* eof usb_cstd_GetD0fifo8Adr() */

/******************************************************************************
Function Name   : usb_cstd_AsspConfig
Description     : Not processed as the functionality is provided by R8A66597(ASSP).
Arguments       : not used
Return value    : -
******************************************************************************/
void usb_cstd_AsspConfig(USB_UTR_t *ptr)
{
}/* eof usb_cstd_AsspConfig() */

/******************************************************************************
Function Name   : usb_cstd_Pinconfig
Description     : Set FIFO select register. This will assign a pipe to the FIFOs, 
                : and control how FIFOs are accessed.
Arguments       : USB_UTR_t *ptr    : USB system internal structure. Selects channel.
Return value    : -
******************************************************************************/
void usb_cstd_Pinconfig(USB_UTR_t *ptr)
{
    if(ptr->ip == USB_USBIP_0)
    {
        /* CFIFO Port Select Register  (0x20) */
        usb_creg_write_fifosel( ptr, USB_CUSE, USB0_CFIFO_MBW );
        /* D0FIFO Port Select Register (0x28) */
        usb_creg_write_fifosel( ptr, USB_D0USE, USB0_D0FIFO_MBW );
        /* D1FIFO Port Select Register (0x2C) */
        usb_creg_write_fifosel( ptr, USB_D1USE, USB0_D1FIFO_MBW );
    }
    else if(ptr->ip == USB_USBIP_1)
    {
        /* CFIFO Port Select Register  (0x20) */
        usb_creg_write_fifosel( ptr, USB_CUSE, USB1_CFIFO_MBW );
        /* D0FIFO Port Select Register (0x28) */
        usb_creg_write_fifosel( ptr, USB_D0USE, USB1_D0FIFO_MBW );
        /* D1FIFO Port Select Register (0x2C) */
        usb_creg_write_fifosel( ptr, USB_D1USE, USB1_D1FIFO_MBW );
    }
    /* setting ENDIAN for CFIFOSEL */
    usb_creg_set_bigend( ptr, USB_CUSE, USB_FIFOENDIAN );
    /* setting ENDIAN for D0FIFOSEL */
    usb_creg_set_bigend( ptr, USB_D0USE, USB_FIFOENDIAN );
    /* setting ENDIAN for D1FIFOSEL */
    usb_creg_set_bigend( ptr, USB_D1USE, USB_FIFOENDIAN );
} /* eof usb_cstd_Pinconfig() */

/******************************************************************************
Function Name   : usb_cstd_InitialClock
Description     : Enable USB module clock. Resets and starts peripheral.
Arguments       : USB_UTR_t *ptr    : USB system internal structure. Selects channel.
Return value    : none
******************************************************************************/
void usb_cstd_InitialClock(USB_UTR_t *ptr)
{
    if (ptr -> ip  == USB_USBIP_0)
    {
        usb_creg_set_scke( ptr );
    }
    else if (ptr -> ip == USB_USBIP_1)
    {

#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        usb_creg_clr_hseb( ptr );
        usb_creg_write_repsel( ptr );
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

        usb_creg_write_clksel( ptr );
        usb_creg_clr_pllreset( ptr );
        usb_creg_clr_dirpd( ptr );
        usb_creg_set_suspendm( ptr );

        while(!(ptr-> ipp1->PLLSTA.BIT.PLLLOCK));
    }
    else{
    }

}/* eof usb_cstd_InitialClock() */

/******************************************************************************
Function Name   : usb_cstd_InterruptClock
Description     : Not processed as the functionality is provided by R8A66597(ASSP).
Arguments       : USB_UTR_t *ptr    : Not used
Return value    : none
******************************************************************************/
void usb_cstd_InterruptClock(USB_UTR_t *ptr)
{
}/* eof usb_cstd_InterruptClock() */

/******************************************************************************
Function Name   : usb_cstd_SelfClock
Description     : Not processed as the functionality is provided by R8A66597(ASSP).
Arguments       : USB_UTR_t *ptr    : Not used
Return value    : none
******************************************************************************/
void usb_cstd_SelfClock(USB_UTR_t *ptr)
{
}/* eof usb_cstd_SelfClock() */

/******************************************************************************
Function Name   : usb_cstd_StopClock
Description     : Not processed as the functionality is provided by R8A66597(ASSP).
Arguments       : USB_UTR_t *ptr    : Not used
Return value    : none
******************************************************************************/
void usb_cstd_StopClock(USB_UTR_t *ptr)
{
}/* eof usb_cstd_StopClock() */

#ifdef USB_DTC_ENABLE
/******************************************************************************
Function Name   : usb_cstd_D0FifoselSet
Description     : Set DOFIFO access width, set to DMA buffer clear mode and 
                : the endian setting.
Arguments       : USB_UTR_t *ptr    : USB system internal structure. Selects channel.
Return value    : none
******************************************************************************/
void usb_cstd_D0FifoselSet(USB_UTR_t *ptr)
{
    /* Big endian mode set */
//  usb_creg_set_bigend( ptr, USB_D0DMA, 1 ); 
    /* DMA buffer clear mode set */
    usb_creg_clr_dclrm( ptr, USB_D0DMA );
    /* Maximum bit width for FIFO access set */
    if(ptr->ip == USB_USBIP_0)
    {
        usb_creg_set_mbw( ptr, USB_D0DMA, USB0_D0FIFO_MBW );
    }
    else if (ptr->ip == USB_USBIP_1)
    {
        usb_creg_set_mbw( ptr, USB_D0DMA, USB1_D0FIFO_MBW );
    }

}/* eof usb_cstd_D0FifoselSet() */
#endif    /* USB_DTC_ENABLE */

