pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_abs.c
    usb_creg_write_pipebuf( ptr, 0 );
    usb_creg_write_pipemaxp( ptr, 0 );
    usb_creg_write_pipeperi( ptr, 0 );
    usb_creg_write_pipesel( ptr, 0 );

    /* FIFO buffer DATA-PID initialized */
    /* SQCLR */
    usb_creg_set_sqclr(ptr, pipe_no);
    /* ACLRM */
    usb_cstd_DoAclrm(ptr, pipe_no);
    /* CSSTS */
    usb_creg_set_csclr(ptr, pipe_no);
    usb_cstd_ClrTransactionCounter(ptr, pipe_no);
    
    /* Interrupt status clear */
    /* Ready         Int Clear */
    usb_creg_clr_sts_brdy( ptr, pipe_no );

    /* NotReady      Int Clear */
    usb_creg_clr_sts_nrdy( ptr, pipe_no );

    /* Empty/SizeErr Int Clear */
    usb_creg_clr_sts_bemp( ptr, pipe_no );
}/* eof usb_cstd_ClrPipeCnfg() */

/******************************************************************************
Function Name   : usb_cstd_WaitUsbip
Description     : Wait USB ASSP ready
Arguments       : USB_UTR_t *ptr    : USB system internal structure. Selects channel.
Return value    : none
******************************************************************************/
void usb_cstd_WaitUsbip(USB_UTR_t *ptr)
{
    /* XCKE Mode Flag */
    usb_gcstd_XckeMode = USB_NO;

    if(ptr->ip == USB_USBIP_0)
    {
        /* Hi-speed enable */
        usb_gcstd_HsEnable[ptr->ip] = USB_HS_DISABLE;
    }
    else if(ptr->ip == USB_USBIP_1)
    {
        /* Hi-speed enable */
#if( USB_SPEED_MODE_PP == USB_HS_PP )
        usb_gcstd_HsEnable[ptr->ip] = USB_HS_ENABLE;
#else   /* USB_SPEED_MODE_PP == USB_HS_PP  */
        usb_gcstd_HsEnable[ptr->ip] = USB_HS_DISABLE;
#endif  /* USB_SPEED_MODE_PP == USB_HS_PP */
    }
}/* eof usb_cstd_WaitUsbip() */

/******************************************************************************
Function Name   : usb_cstd_SetNak
Description     : Set up to NAK the specified pipe.
Arguments       : USB_UTR_t *ptr    : USB system internal structure. Selects channel.
                : uint16_t pipe     : Pipe Number
Return value    : none
******************************************************************************/
void usb_cstd_SetNak(USB_UTR_t *ptr, uint16_t pipe)
{
    uint16_t        buf, n;

    /* Set NAK */
    usb_creg_clr_pid( ptr, pipe, (uint16_t)USB_PID_BUF );

    /* The state of PBUSY continues while transmitting the packet when it is a detach. */
    /* 1ms comes off when leaving because the packet duration might not exceed 1ms.  */
    /* Whether it is PBUSY release or 1ms passage can be judged. */
    for( n = 0; n < 0xFFFFu; ++n )
    {
        /* PIPE control reg read */
        buf = usb_creg_read_pipectr( ptr, pipe );
        if( (uint16_t)(buf & USB_PBUSY) == 0 )
        {
            n = 0xFFFEu;
        }
    }
}/* eof usb_cstd_SetNak() */

/******************************************************************************
Function Name   : usb_cstd_write_fifo
Description     : Write specified amount of data to specified USB FIFO. 
Arguments       : USB_UTR_t *ptr        : USB system internal structure. Selects channel.
                : uint16_t  count       : Write size.
                : uint16_t  pipemode    : The mode of CPU/DMA(D0)/DMA(D1).
                : uint16_t  *write_p    : Address of buffer of data to write.
Return value    : The incremented address of last argument (write_p).
******************************************************************************/
uint8_t *usb_cstd_write_fifo( USB_UTR_t *ptr, uint16_t count, uint16_t pipemode, uint8_t *write_p )
{
    uint16_t    even;
    uint16_t    odd;

    if(ptr->ip == USB_USBIP_0)
    {
        for( even = (uint16_t)(count >> 1); (even != 0); --even )
        {
            /* 16bit access */
            usb_creg_write_fifo16( ptr, pipemode, *((uint16_t *)write_p) );

            /* Renewal write pointer */
            write_p += sizeof(uint16_t);
        }

        if( (count & (uint16_t)0x0001u) != 0u )
        {
            /* 8bit access */
            /* count == odd */
            /* Change FIFO access width */
            usb_creg_set_mbw( ptr, pipemode, USB_MBW_8 );

            /* FIFO write */
            usb_creg_write_fifo8( ptr, pipemode, *write_p );

            /* Return FIFO access width */
            usb_creg_set_mbw( ptr, pipemode, USB_MBW_16 );

            /* Renewal write pointer */
            write_p++;
        }
    }
    else if(ptr->ip == USB_USBIP_1)
    {
        for( even = (uint16_t)(count >> 2); (even != 0); --even )
        {
            /* 16bit access */
            usb_creg_write_fifo32( ptr, pipemode, *((uint32_t *)write_p) );

            /* Renewal write pointer */
            write_p += sizeof(uint32_t);
        }
        odd = count % 4;
        if( (odd & (uint16_t)0x0002u) != 0u )
        {
            /* 16bit access */
            /* Change FIFO access width */
            usb_creg_set_mbw( ptr, pipemode, USB_MBW_16 );
            /* FIFO write */
            usb_creg_write_fifo16( ptr, pipemode, *((uint16_t *)write_p) );

            /* Renewal write pointer */
            write_p += sizeof(uint16_t);
        }
        if( (odd & (uint16_t)0x0001u) != 0u )
        {
            /* 8bit access */
            /* count == odd */
            /* Change FIFO access width */
            usb_creg_set_mbw( ptr, pipemode, USB_MBW_8 );

            /* FIFO write */
            usb_creg_write_fifo8( ptr, pipemode, *write_p );

            /* Renewal write pointer */
            write_p++;
        }
        /* Return FIFO access width */
        usb_creg_set_mbw( ptr, pipemode, USB_MBW_32 );
    }
    return write_p;

}/* eof usb_cstd_write_fifo() */

/******************************************************************************
Function Name   : usb_cstd_read_fifo
Description     : Read specified buffer size from the USB FIFO.
Arguments       : USB_UTR_t *ptr        : USB system internal structure. Selects channel.
                : uint16_t  count       : Read size.
                : uint16_t  pipemode    : The mode of CPU/DMA(D0)/DMA(D1).
                : uint16_t  *write_p    : Address of buffer to store the read data.
Return value    : Pointer to a buffer that contains the data to be read next.
******************************************************************************/
uint8_t *usb_cstd_read_fifo( USB_UTR_t *ptr, uint16_t count, uint16_t pipemode, uint8_t *read_p )
{
    uint16_t    even;
    uint16_t    odd;
    uint32_t    odd_byte_data_temp;
#if USB_CPUBYTE_PP != USB_BYTE_LITTLE_PP
    uint16_t    i;
#endif
    if(ptr->ip == USB_USBIP_0)
    {
        for( even = (uint16_t)(count >> 1); (even != 0); --even )
        {
            /* 16bit FIFO access */
            *(uint16_t *)read_p= usb_creg_read_fifo16( ptr, pipemode );

            /* Renewal read pointer */
            read_p += sizeof( uint16_t );
        }
        if( (count & (uint16_t)0x0001) != 0 )
        {
             /* 16bit FIFO access */
            odd_byte_data_temp = usb_creg_read_fifo16( ptr, pipemode );
/* Condition compilation by the difference of the endian */
#if USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP
            *read_p = (uint8_t)( odd_byte_data_temp & 0x00ff);
#else    /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
            *read_p = (uint8_t)( odd_byte_data_temp >> 8 );
#endif    /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
            /* Renewal read pointer */
            read_p += sizeof( uint8_t );
        }
    }
    else if(ptr->ip == USB_USBIP_1)
    {
        for( even = (uint16_t)(count >> 2); (even != 0); --even )
        {
            /* 32bit FIFO access */
            *(uint32_t *)read_p= usb_creg_read_fifo32( ptr, pipemode );

            /* Renewal read pointer */
            read_p += sizeof( uint32_t );
        }
        odd = count % 4;
        if(count < 4)
        {
            odd = count;
        }
        if( odd != 0 )
        {
             /* 32bit FIFO access */
            odd_byte_data_temp = usb_creg_read_fifo32( ptr, pipemode );
/* Condition compilation by the difference of the endian */
#if USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP
            do{
                *read_p = (uint8_t)( odd_byte_data_temp & 0x000000ff );
                odd_byte_data_temp = odd_byte_data_temp >> 8;
                /* Renewal read pointer */
                read_p += sizeof( uint8_t );
                odd--;
            }while( odd != 0 );
#else    /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
            for(i = 0; i < odd; i++)
            {
                *read_p = (uint8_t)( ( odd_byte_data_temp >> (24 -(i*8))) & 0x000000ff );
                /* Renewal read pointer */
                read_p += sizeof( uint8_t );
            }
#endif    /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
        }
    }
    return read_p;
}/* eof usb_cstd_read_fifo() */

