pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_abs.c
/******************************************************************************
Function Name   : usb_cstd_ForcedTermination
Description     : Terminate data transmission and reception.
Arguments       : USB_UTR_t *ptr    : USB system internal structure. Selects channel.
                : uint16_t pipe     : Pipe Number
                : uint16_t status   : Transfer status type
Return value    : none
Note            : In the case of timeout status, it does not call back.
******************************************************************************/
void usb_cstd_ForcedTermination(USB_UTR_t *ptr, uint16_t pipe, uint16_t status)
{
    uint16_t    buffer;

    /* PID = NAK */
    /* Set NAK */
    usb_cstd_SetNak(ptr, pipe);

    /* Disable Interrupt */
    /* Disable Ready Interrupt */
    usb_creg_clr_brdyenb(ptr, pipe);
    /* Disable Not Ready Interrupt */
    usb_creg_clr_nrdyenb(ptr, pipe);
    /* Disable Empty Interrupt */
    usb_creg_clr_bempenb(ptr, pipe);

    usb_cstd_ClrTransactionCounter(ptr, pipe);

    /* Clear D1FIFO-port */
    buffer = usb_creg_read_fifosel( ptr, USB_CUSE );
    if( (buffer & USB_CURPIPE) == pipe )
    {
        if(ptr->ip == USB_USBIP_0)
        {
            usb_creg_set_mbw( ptr, USB_CUSE, USB0_CFIFO_MBW );
        }
        else if (ptr->ip == USB_USBIP_1)
        {
            usb_creg_set_mbw( ptr, USB_CUSE, USB1_CFIFO_MBW );
        }

        /* Changes the FIFO port by the pipe. */
        usb_cstd_chg_curpipe(ptr, (uint16_t)USB_PIPE0, (uint16_t)USB_CUSE, USB_NO);
    }
#ifdef USB_DTC_ENABLE
    /* Clear D0FIFO-port */
    buffer = usb_creg_read_fifosel( ptr, USB_D0DMA );
    if( (buffer & USB_CURPIPE) == pipe )
    {
        /* Stop DMA,FIFO access */
        usb_cpu_d0fifo_stop_dma(ptr);

        usb_cstd_D0fifoStopUsb(ptr);
        usb_cstd_D0FifoselSet(ptr);
        if(ptr->ip == USB_USBIP_0)
        {
            usb_creg_write_dmacfg( ptr, USB_D0DMA, USB_CPU_ADR_RD_WR );
        }
        else if (ptr->ip == USB_USBIP_1)
        {
//            usb_creg_set_mbw( ptr, USB_D1USE, USB1_D1FIFO_MBW );
        }
        /* Changes the FIFO port by the pipe. */
        usb_cstd_chg_curpipe(ptr, (uint16_t)USB_PIPE0, (uint16_t)USB_D0USE, USB_NO);
    }
    /* Clear D1FIFO-port */
    buffer = usb_creg_read_fifosel( ptr, USB_D1DMA );
    if( (buffer & USB_CURPIPE) == pipe )
    {
        if(ptr->ip == USB_USBIP_0)
        {
            usb_creg_set_mbw( ptr, USB_D1USE, USB0_D1FIFO_MBW );
        }
        else if (ptr->ip == USB_USBIP_1)
        {
            usb_creg_set_mbw( ptr, USB_D1USE, USB1_D1FIFO_MBW );
        }
        /* Changes the FIFO port by the pipe. */
        usb_cstd_chg_curpipe(ptr, (uint16_t)USB_PIPE0, (uint16_t)USB_D1USE, USB_NO);
    }
#endif    /* USB_DTC_ENABLE */

    /* Changes the FIFO port by the pipe. */
    usb_cstd_chg_curpipe(ptr, pipe, (uint16_t)USB_CUSE, USB_NO);
    buffer = usb_creg_read_fifoctr( ptr, USB_CUSE );
    if( (uint16_t)(buffer & USB_FRDY) == USB_FRDY )
    {
        /* Clear BVAL */
        usb_creg_set_bclr( ptr, USB_CUSE );
    }

    /* FIFO buffer SPLIT transaction initialized */
    usb_cstd_chg_curpipe(ptr, (uint16_t)USB_PIPE0, (uint16_t)USB_CUSE, USB_NO);
    usb_creg_set_csclr(ptr, pipe);

    /* Call Back */
    if( usb_gcstd_Pipe[ptr->ip][pipe] != USB_NULL )
    {
        /* Transfer information set */
        usb_gcstd_Pipe[ptr->ip][pipe]->tranlen  = usb_gcstd_DataCnt[ptr->ip][pipe];
        usb_gcstd_Pipe[ptr->ip][pipe]->status   = status;
        usb_gcstd_Pipe[ptr->ip][pipe]->pipectr  = usb_creg_read_pipectr(ptr, pipe);
#if USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP
        usb_gcstd_Pipe[ptr->ip][pipe]->errcnt   = (uint8_t)usb_ghstd_IgnoreCnt[ptr->ip][pipe];
#else   /* USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP */
        usb_gcstd_Pipe[ptr->ip][pipe]->errcnt   = 0;
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP */

        usb_gcstd_Pipe[ptr->ip][pipe]->ipp  = ptr->ipp;
        usb_gcstd_Pipe[ptr->ip][pipe]->ip   = ptr->ip;

        if( USB_NULL != ( usb_gcstd_Pipe[ptr->ip][pipe]->complete ) )
        {
            (usb_gcstd_Pipe[ptr->ip][pipe]->complete)(usb_gcstd_Pipe[ptr->ip][pipe], 0, 0);
        }
        usb_gcstd_Pipe[ptr->ip][pipe] = (USB_UTR_t*)USB_NULL;
    }
}/* eof usb_cstd_ForcedTermination() */

/******************************************************************************
Function Name   : usb_cstd_nrdy_endprocess
Description     : NRDY interrupt processing. (Forced termination of data trans-
                : mission and reception of specified pipe.)
Arguments       : USB_UTR_t *ptr       : USB system internal structure. Selects channel.
                : uint16_t  pipe        : Pipe No
Return value    : none
Note            : none
******************************************************************************/
void    usb_cstd_nrdy_endprocess( USB_UTR_t *ptr, uint16_t pipe )
{
    if( usb_cstd_is_host_mode(ptr) == USB_YES )
    {
#if USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP
        uint16_t    buffer;

        /*
            Host Function
        */
        buffer = usb_cstd_GetPid(ptr, pipe);
        /* STALL ? */
        if( (buffer & USB_PID_STALL) == USB_PID_STALL )
        {
            USB_PRINTF1("### STALL Pipe %d\n", pipe);
            /* @4 */
            /* End of data transfer */
            usb_cstd_ForcedTermination(ptr, pipe, USB_DATA_STALL);
        }
        else
        {
            /* Wait for About 60ns */
            buffer = usb_creg_read_syssts( ptr, USB_PORT0 );
            /* @3 */
            usb_ghstd_IgnoreCnt[ptr->ip][pipe]++;
            USB_PRINTF2("### IGNORE Pipe %d is %d times \n", pipe, usb_ghstd_IgnoreCnt[ptr->ip][pipe]);
            if( usb_ghstd_IgnoreCnt[ptr->ip][pipe] == USB_PIPEERROR )
            {
                /* Data Device Ignore X 3 call back */
                /* End of data transfer */
                usb_cstd_ForcedTermination(ptr, pipe, USB_DATA_ERR);
            }
            else
            {
                /* 5ms wait */
                usb_cpu_DelayXms(5);
                /* PIPEx Data Retry */
                usb_cstd_SetBuf(ptr, pipe);
            }
        }
#endif  /* USB_FUNCSEL_USBIP0_PP == USB_HOST_PP || USB_FUNCSEL_USBIP1_PP == USB_HOST_PP */
    }
}/* eof usb_cstd_nrdy_endprocess() */

/******************************************************************************
End of file
******************************************************************************/

